# Extração e Manipulação de Dados I

## Novas perguntas/requisições do CEO

1. Crie uma nova coluna chamada: “house_age”
    - Se o valor da coluna “date” for maior que 2014-01-01 => ‘new_house’
    - Se o valor da coluna “date” for menor que 2014-01-01 => ‘old_house’

2. Crie uma nova coluna chamada: “dormitory_type”
    - Se o valor da coluna “bedrooms” for igual à 1 => ‘studio’
    - Se o valor da coluna “bedrooms” for igual a 2 => ‘apartament’
    - Se o valor da coluna “bedrooms” for maior que 2 => ‘house’

3. Crie uma nova coluna chamada: “condition_type”
    - Se o valor da coluna “condition” for menor ou igual à 2 => ‘bad’
    - Se o valor da coluna “condition” for igual à 3 ou 4 => ‘regular’
    - Se o valor da coluna “condition” for igual à 5 => ‘good’


4. Modifique o TIPO a Coluna “condition” para STRING


5. Delete as colunas: “sqft_living15” e “sqft_lot15”


6. Modifique o TIPO a Coluna “yr_build” para DATE


7. Modifique o TIPO a Coluna “yr_renovated” para DATE


8. Qual a data mais antiga de construção de um imóvel?


9. Qual a data mais antiga de renovação de um imóvel?


10. Quantos imóveis tem 2 andares?


11. Quantos imóveis estão com a condição igual a “regular” ?


12. Quantos imóveis estão com a condição igual a “bad”e possuem “vista para água” ?


13. Quantos imóveis estão com a condição igual a “good” e são “new_house”?


14. Qual o valor do imóvel mais caro do tipo “studio” ?


15. Quantos imóveis do tipo “apartment” foram reformados em 2015 ?


16. Qual o maior número de quartos que um imóveis do tipo “house” possui ?


17. Quantos imóveis “new_house” foram reformados no ano de 2014?


18. Selecione as colunas: “id”, “date”, “price”, “floors”, “zipcode” pelo método:
    - Direto pelo nome das colunas.
    - Pelos Índices.
    - Pelos Índices das linhas e o nome das colunas
    - Índices Booleanos		
    
    
19. Salve um arquivo .csv com somente as colunas do item 10 ao 17.


20. Modifique a cor dos pontos no mapa de “pink” para “verde-escuro”

# Resolução

## Import Libraries

In [50]:
import plotly.express as px
import pandas as pd
import numpy as np

## Loading Data

In [51]:
data = pd.read_csv('datasets/kc_house_data.csv')
data.head(2)

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,7129300520,20141013T000000,221900.0,3,1.00,1180,5650,1.0,0,0,...,7,1180,0,1955,0,98178,47.5112,-122.257,1340,5650
1,6414100192,20141209T000000,538000.0,3,2.25,2570,7242,2.0,0,0,...,7,2170,400,1951,1991,98125,47.7210,-122.319,1690,7639

## 1. Crie uma nova coluna chamada: “house_age”
- Se o valor da coluna “date” for maior que 2014-01-01 => ‘new_house’
- Se o valor da coluna “date” for menor que 2014-01-01 => ‘old_house’

Antes, precisamos confirmar que a coluna date está no formato de data.

In [52]:
data['date'] = pd.to_datetime(data['date'], format='%Y-%m-%d')
data.dtypes[[0, 1]]

id               int64
date    datetime64[ns]
dtype: object

Criando uima coluna com base na data:

In [53]:
data['house_age'] = 'Na'
data.loc[data['date'] > '2014-01-01','house_age'] = 'new_house'
data.loc[data['date'] < '2014-01-01','house_age'] = 'old_house'

In [54]:
data['house_age'].unique()

array(['new_house'], dtype=object)

## 2. Crie uma nova coluna chamada: “dormitory_type”
- Se o valor da coluna “bedrooms” for igual à 1 => ‘studio’
- Se o valor da coluna “bedrooms” for igual a 2 => ‘apartament’
- Se o valor da coluna “bedrooms” for maior que 2 => ‘house’

In [55]:
data['dormitory_type'] = 'Na'
data.loc[data['bedrooms'] == 1, 'dormitory_type'] = 'studio'
data.loc[data['bedrooms'] == 2, 'dormitory_type'] = 'apartament'
data.loc[data['bedrooms'] > 2, 'dormitory_type'] = 'house'

In [56]:
data.head(2)

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15,house_age,dormitory_type
0,7129300520,2014-10-13,221900.0,3,1.00,1180,5650,1.0,0,0,...,0,1955,0,98178,47.5112,-122.257,1340,5650,new_house,house
1,6414100192,2014-12-09,538000.0,3,2.25,2570,7242,2.0,0,0,...,400,1951,1991,98125,47.7210,-122.319,1690,7639,new_house,house

## 3. Crie uma nova coluna chamada: “condition_type”
- Se o valor da coluna “condition” for menor ou igual à 2 => ‘bad’
- Se o valor da coluna “condition” for igual à 3 ou 4 => ‘regular’
- Se o valor da coluna “condition” for igual à 5 => ‘good’

In [57]:
# data['condition_type'] = 'Na'
# data.loc[data['condition'] <= 2, 'condition_type'] = 'bad'
# data.loc[(data['condition'] == 3) | (data['condition'] == 4), 'condition_type'] = 'regular'
# data.loc[data['condition'] == 5, 'condition_type'] = 'good'

In [58]:
data['condition'] = data['condition'].astype(int)

In [59]:
data['condition_type'] = data['condition'].apply( lambda x: 'bad' if x <= 2 else 'regular' if (x == 3) | (x == 4) else 'good')

In [60]:
data['condition_type'].unique()

array(['regular', 'good', 'bad'], dtype=object)

## 4. Modifique o TIPO a Coluna “condition” para STRING

In [61]:
data['condition'] = data['condition'].astype(str)

In [62]:
data[['id', 'condition', 'condition_type']].dtypes

id                 int64
condition         object
condition_type    object
dtype: object

## 5. Delete as colunas: “sqft_living15” e “sqft_lot15”

In [63]:
data = data.drop(['sqft_living15', 'sqft_lot15'], axis=1)

## 6. Modifique o TIPO a Coluna “yr_build” para DATE

In [64]:
data['yr_built'] = pd.to_datetime(data['yr_built'], format='%Y')

In [65]:
data.head(2)

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,house_age,dormitory_type,condition_type
0,7129300520,2014-10-13,221900.0,3,1.00,1180,5650,1.0,0,0,...,1180,0,1955-01-01,0,98178,47.5112,-122.257,new_house,house,regular
1,6414100192,2014-12-09,538000.0,3,2.25,2570,7242,2.0,0,0,...,2170,400,1951-01-01,1991,98125,47.7210,-122.319,new_house,house,regular

## 7. Modifique o TIPO a Coluna “yr_renovated” para DATE

In [66]:
data['yr_renovated'] = data['yr_renovated'].apply(lambda x: pd.to_datetime(x, format='%Y') if x > 0 else pd.to_datetime('1900-01-1'))

In [67]:
data.head(2)

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,house_age,dormitory_type,condition_type
0,7129300520,2014-10-13,221900.0,3,1.00,1180,5650,1.0,0,0,...,1180,0,1955-01-01,1900-01-01,98178,47.5112,-122.257,new_house,house,regular
1,6414100192,2014-12-09,538000.0,3,2.25,2570,7242,2.0,0,0,...,2170,400,1951-01-01,1991-01-01,98125,47.7210,-122.319,new_house,house,regular

## 8. Qual a data mais antiga de construção de um imóvel?

In [68]:
min_date = data['yr_built'].min().year
print(f'A casa mais antiga foi construída no ano de {min_date}.')

A casa mais antiga foi construída no ano de 1900.

## 9. Qual a data mais antiga de renovação de um imóvel?

In [76]:
old_renovated = data[data['yr_renovated'] > '1900-01-01']['yr_renovated']
print(f'O ano mais antigo de renovação foi em {old_renovated.min().year}.')

O ano mais antigo de renovação foi em 1934.

## 10. Quantos imóveis tem 2 andares?

In [80]:
two_floors = len(data[data['floors'] == 2]['id'].unique())
print(f'Number of houses with two floors: {two_floors}.')

Number of houses with two floors: 8209.

In [81]:
two_floors = len(data[data['floors'] == 2])
print(f'Number of houses with two floors: {two_floors}.')

Number of houses with two floors: 8241.

## 11. Quantos imóveis estão com a condição igual a “regular” ?

In [82]:
regular_houses = len(data[data['condition_type'] == 'regular'])
print(f'Number of regular houses: {regular_houses}.')

Number of regular houses: 19710.

In [83]:
regular_houses = len(data[data['condition_type'] == 'regular']['id'].unique())
print(f'Number of regular houses: {regular_houses}.')

Number of regular houses: 19556.

## 12. Quantos imóveis estão com a condição igual a “bad”e possuem “vista para água” ?

In [88]:
houses_water_bad = data[(data['condition_type'] == 'bad') & (data['waterfront'] == 1)]
print(f'Houses with water view and bad condition: {houses_water_bad.shape[0]}.')

Houses with water view and bad condition: 2.

In [89]:
houses_water_bad = data[(data['condition_type'] == 'bad') & (data['waterfront'] == 1)]['id'].unique()
print(f'Houses with water view and bad condition: {houses_water_bad.shape[0]}.')

Houses with water view and bad condition: 2.

## 13. Quantos imóveis estão com a condição igual a “good” e são “new_house”?

In [90]:
good_new_houses = data[(data['condition_type'] == 'good') & (data['house_age'] == 'new_house')]
print(f'New houses and with good condition: {good_new_houses.shape[0]}.')

New houses and with good condition: 1701.

In [91]:
good_new_houses = data[(data['condition_type'] == 'good') & (data['house_age'] == 'new_house')]['id'].unique()
print(f'New houses and with good condition: {good_new_houses.shape[0]}.')

New houses and with good condition: 1687.

## 14. Qual o valor do imóvel mais caro do tipo “studio” ?

In [99]:
studio_houses = data[data['dormitory_type'] == 'studio']['price'].max()
print(f'The most expensive studio house price ${studio_houses}0')

The most expensive studio house price $1247000.00

## 15. Quantos imóveis do tipo “apartment” foram reformados em 2015 ?

In [137]:
apartament_2015 = data[(data['dormitory_type'] == 'apartament') & (data['yr_renovated'] == '2015')]
print(f'Number of apartament houses that reformed in 2015: {apartment_2015.shape[0]}.')

Number of apartament houses that reformed in 2015: 0.

In [138]:
number = data.loc[(data['dormitory_type']== 'apartament') & (data['yr_renovated']== '2014'), 'id'].size
print(f'Number of apartament houses that reformed in 2015: {number}.')

Number of apartament houses that reformed in 2015: 3.

## 16. Qual o maior número de quartos que um imóveis do tipo “house” possui ?

In [134]:
max_bedhouses = data.loc[data['dormitory_type'] == 'house', 'bedrooms'].max()
print(f'Max of bedrooms from houses: {max_bedhouses}.')

Max of bedrooms from houses: 33.

## 17. Quantos imóveis “new_house” foram reformados no ano de 2014?

In [139]:
new_houses2014r = data.loc[(data['house_age'] == 'new_house') & (data['yr_renovated'] == '2014')]
print(f'Number of new houses reformed in 2014: {new_houses2014r.shape[0]}.')

Number of new houses reformed in 2014: 91.

## 18. Selecione as colunas: “id”, “date”, “price”, “floors”, “zipcode” pelo método:
- Direto pelo nome das colunas
- Pelos índices
- Pelos índices das linhas e o nome das colunas
- Índices Booleanos

In [143]:
data.columns

Index(['id', 'date', 'price', 'bedrooms', 'bathrooms', 'sqft_living',
       'sqft_lot', 'floors', 'waterfront', 'view', 'condition', 'grade',
       'sqft_above', 'sqft_basement', 'yr_built', 'yr_renovated', 'zipcode',
       'lat', 'long', 'house_age', 'dormitory_type', 'condition_type'],
      dtype='object')

In [144]:
d1 = data[['id', 'date', 'price', 'floors', 'zipcode']]
d1.head(1)

           id       date     price  floors  zipcode
0  7129300520 2014-10-13  221900.0     1.0    98178

In [145]:
d2 = data.iloc[:, [0, 1, 2, 7, 16]]
d2.head(1)

           id       date     price  floors  zipcode
0  7129300520 2014-10-13  221900.0     1.0    98178

In [146]:
d3 = data.loc[:, ['id', 'date', 'price', 'floors', 'zipcode']]
d3.head(1)

           id       date     price  floors  zipcode
0  7129300520 2014-10-13  221900.0     1.0    98178

In [147]:
data.columns.to_list

<bound method IndexOpsMixin.tolist of Index(['id', 'date', 'price', 'bedrooms', 'bathrooms', 'sqft_living',
       'sqft_lot', 'floors', 'waterfront', 'view', 'condition', 'grade',
       'sqft_above', 'sqft_basement', 'yr_built', 'yr_renovated', 'zipcode',
       'lat', 'long', 'house_age', 'dormitory_type', 'condition_type'],
      dtype='object')>

In [149]:
d4 = data.loc[:, [True, True, True, False, False, False,
       False , True, False, False, False, False,
       False, False, False, False, True,
       False, False, False, False, False]]
d4.head(1)

           id       date     price  floors  zipcode
0  7129300520 2014-10-13  221900.0     1.0    98178

[True, True, True, False, False, False,
       False , True, False, False, False, False,
       False, False, False, False, True,
       False, False, False, False, False]

## 19. Salve um arquivo .csv com somente as colunas do item 10 ao 17.

In [85]:
data[['house_age', 'dormitory_type', 'condition_type']].to_csv('new_attributes.csv')